namespace PicoPDF.Pdf.Documents;

// JIS X 4051
public class JapaneseLineBreakRule : ILineBreakRule
{
    public int[] DenyStartChar { get; init; } = [
            ',', ')', ']', '｝', '、', '〕', '〉', '》', '」', '』', '】', '〙', '〗', '〟', '’', '”', '｠', '»',
            'ゝ', 'ゞ', 'ー',
            'ァ', 'ィ', 'ゥ', 'ェ', 'ォ',
            'ッ', 'ャ', 'ュ', 'ョ', 'ヮ', 'ヵ', 'ヶ',
            'ぁ', 'ぃ', 'ぅ', 'ぇ', 'ぉ',
            'っ', 'ゃ', 'ゅ', 'ょ', 'ゎ', 'ゕ', 'ゖ',
            'ㇰ', 'ㇱ', 'ㇲ', 'ㇳ', 'ㇴ',
            'ㇵ', 'ㇶ', 'ㇷ', 'ㇸ', 'ㇹ',
            'ㇺ',
            'ㇻ', 'ㇼ', 'ㇽ', 'ㇾ', 'ㇿ',
            '々', '〻',
            '?', '!', '‼', '⁇', '⁈', '⁉',
            '・', ':', ';', '/',
            '。', '.',
        ];

    public int[] DenyEndChar { get; init; } = [
            '(', '[', '｛', '〔', '〈', '《', '「', '『', '【', '〘', '〖', '〝', '‘', '“', '｟', '«',
        ];
}
